In [3]:
import pandas as pd
import numpy as np
toyotadf=pd.read_csv('Documents/Toyota.csv')
toyotadf

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [4]:
toyotadf.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170

In [5]:
toyotadf.tail()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [7]:
toyotadf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB

In [9]:
toyotadf['HP'].unique()

array(['90', '????', '192', '110', '97', '71', '116', '98', '69', '86',
       '72', '107', '73'], dtype=object)

In [11]:
toyotadf['KM'].unique()

array(['46986', '72937', '41711', ..., '30964', '20544', '17016'],
      dtype=object)

In [14]:
toyotadf['MetColor']= toyotadf['MetColor'].astype("object")
toyotadf['Automatic']= toyotadf['Automatic'].astype("object")

In [15]:
toyotadf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   object
 7   Automatic   1436 non-null   object
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(1), int64(4), object(6)
memory usage: 123.5+ KB

In [16]:
toyotadf["Doors"].unique()

array(['three', '3', '5', '4', 'four', 'five', '2'], dtype=object)

In [21]:
toyotadf.Doors.replace('five',5,inplace=True)
toyotadf.Doors.replace('three',3,inplace=True)
toyotadf.Doors.replace('four',4,inplace=True)
toyotadf.Doors.replace('5',5,inplace=True)
toyotadf.Doors.replace('4',3,inplace=True)
toyotadf.Doors.replace('3',4,inplace=True)

In [22]:
toyotadf["Doors"].unique()

array([3, 4, 5, '2'], dtype=object)

In [23]:
toyotadf['Doors']= toyotadf['Doors'].astype("int64")

In [24]:
toyotadf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   object
 7   Automatic   1436 non-null   object
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   int64
 10  Weight      1436 non-null   int64
dtypes: float64(1), int64(5), object(5)
memory usage: 123.5+ KB

In [25]:
toyotadf.isnull( ).sum( )

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [26]:
toyotadf.isna( ).sum( )

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [28]:
toyotadf["FuelType"]

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

In [29]:
toyotadf["FuelType"].unique()

array(['Diesel', nan, 'Petrol', 'CNG'], dtype=object)

In [30]:
toyotadf.describe()

,Unnamed: 0,Price,Age,CC,Doors,Weight
count,1436.000000,1436.000000,1336.000000,1436.000000,1436.000000,1436.00000
mean,717.500000,10730.824513,55.672156,1566.827994,4.370474,1072.45961
std,414.681806,3626.964585,18.589804,187.182436,0.658849,52.64112
min,0.000000,4350.000000,1.000000,1300.000000,2.000000,1000.00000
25%,358.750000,8450.000000,43.000000,1400.000000,4.000000,1040.00000
50%,717.500000,9900.000000,60.000000,1600.000000,4.000000,1070.00000
75%,1076.250000,11950.000000,70.000000,1600.000000,5.000000,1085.00000
max,1435.000000,32500.000000,80.000000,2000.000000,5.000000,1615.00000

In [32]:
toyotadf["Age"].tail(10)

1426    78.0
1427     NaN
1428    72.0
1429    78.0
1430    80.0
1431     NaN
1432    72.0
1433     NaN
1434    70.0
1435    76.0
Name: Age, dtype: float64

In [33]:
toyotadf["Age"].fillna(toyotadf["Age"].mean(), inplace=True)

In [34]:
toyotadf["Age"].tail(10)

1426    78.000000
1427    55.672156
1428    72.000000
1429    78.000000
1430    80.000000
1431    55.672156
1432    72.000000
1433    55.672156
1434    70.000000
1435    76.000000
Name: Age, dtype: float64

In [35]:
toyotadf["Age"].value_counts()

Age
55.672156    100
65.000000     62
68.000000     60
80.000000     52
78.000000     41
            ...
15.000000      2
18.000000      1
6.000000       1
10.000000      1
2.000000       1
Name: count, Length: 78, dtype: int64